# Pandas

In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.23.4'

### Creating a Dataframe

In [3]:
# First Method
import pandas as pd 
data = [['Alex',10],['Bob',12],['Clarke',13]]
df1 = pd.DataFrame(data)
print(df1.columns)
df1

RangeIndex(start=0, stop=2, step=1)

        0   1
0    Alex  10
1     Bob  12
2  Clarke  13

In [2]:
# Second Method
import pandas as pd
data1 = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df2= pd.DataFrame(data1)
df2

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [3]:
# Third Method
d = {'Names':['Bob','Jessica','Mary','John','Mel','Max'], 'birthdates':[1968, 1955, 1977, 1978, 1973, 2001]}
df = pd.DataFrame(data=d)
df.head() #By default prints first 5 rows
#df.head(6)
#df.tail()

     Names  birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973

In [6]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [7]:
df1.columns

RangeIndex(start=0, stop=2, step=1)

In [4]:
df2.columns

Index(['a', 'b', 'c'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=6, step=1)

### Pandas series objects

In [10]:
print(type(df['Names']))

<class 'pandas.core.series.Series'>

In [11]:
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
5        Max
Name: Names, dtype: object

In [12]:
df[['Names','birthdates']]

     Names  birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973
5      Max        2001

### Renaming the columns

In [13]:
df.columns=['Names','Birthdates']
df

     Names  Birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973
5      Max        2001

### Appending new rows

In [14]:
new_data = pd.DataFrame([['Mark', 1951]], columns=['Names', 'Birthdates'])#First method
df = df.append(new_data)
df

     Names  Birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973
5      Max        2001
0     Mark        1951

In [15]:
i = [0,1,2,3,4,5,6]
df.index = i
df

     Names  Birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973
5      Max        2001
6     Mark        1951

In [16]:
df.loc['7'] = ['Stark', 1973] #Second method
df

     Names  Birthdates
0      Bob        1968
1  Jessica        1955
2     Mary        1977
3     John        1978
4      Mel        1973
5      Max        2001
6     Mark        1951
7    Stark        1973

### Appending new columns

In [17]:
new = pd.DataFrame(columns=['Names', 'Birthdates','Age'])#First method
df = df.append(new)
df

c:\program files (x86)\python37-32\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   Age Birthdates    Names
0  NaN       1968      Bob
1  NaN       1955  Jessica
2  NaN       1977     Mary
3  NaN       1978     John
4  NaN       1973      Mel
5  NaN       2001      Max
6  NaN       1951     Mark
7  NaN       1973    Stark

In [18]:
df['Gender'] = 'male'#Second method
df

   Age Birthdates    Names Gender
0  NaN       1968      Bob   male
1  NaN       1955  Jessica   male
2  NaN       1977     Mary   male
3  NaN       1978     John   male
4  NaN       1973      Mel   male
5  NaN       2001      Max   male
6  NaN       1951     Mark   male
7  NaN       1973    Stark   male

In [19]:
df.loc[0, 'Age'] = 50
df.loc[3, 'Age'] = 40
df.loc[5, 'Age'] = 17
df.loc[6, 'Age'] = 67
df.loc[1, 'Age'] = 63

df.loc[1, 'Sex'] = 'female'
df.loc[2, 'Sex'] = 'female'
df.loc[4, 'Sex'] = 'female'
df

   Age Birthdates    Names Gender     Sex
0   50       1968      Bob   male     NaN
1   63       1955  Jessica   male  female
2  NaN       1977     Mary   male  female
3   40       1978     John   male     NaN
4  NaN       1973      Mel   male  female
5   17       2001      Max   male     NaN
6   67       1951     Mark   male     NaN
7  NaN       1973    Stark   male     NaN

### Indexing using labels

In [20]:
df.loc[:,"Birthdates":]

  Birthdates    Names Gender     Sex
0       1968      Bob   male     NaN
1       1955  Jessica   male  female
2       1977     Mary   male  female
3       1978     John   male     NaN
4       1973      Mel   male  female
5       2001      Max   male     NaN
6       1951     Mark   male     NaN
7       1973    Stark   male     NaN

In [21]:
df.loc[df.index[:3],['Names', 'Sex','Age','Birthdates']]

     Names     Sex  Age Birthdates
0      Bob     NaN   50       1968
1  Jessica  female   63       1955
2     Mary  female  NaN       1977

In [22]:
df.iloc[0:3]

   Age Birthdates    Names Gender     Sex
0   50       1968      Bob   male     NaN
1   63       1955  Jessica   male  female
2  NaN       1977     Mary   male  female

In [23]:
df.iloc[-4:-2]

   Age Birthdates Names Gender     Sex
4  NaN       1973   Mel   male  female
5   17       2001   Max   male     NaN

In [24]:
df.iloc[0::2]

   Age Birthdates Names Gender     Sex
0   50       1968   Bob   male     NaN
2  NaN       1977  Mary   male  female
4  NaN       1973   Mel   male  female
6   67       1951  Mark   male     NaN

In [25]:
df.iloc[::-1]

   Age Birthdates    Names Gender     Sex
7  NaN       1973    Stark   male     NaN
6   67       1951     Mark   male     NaN
5   17       2001      Max   male     NaN
4  NaN       1973      Mel   male  female
3   40       1978     John   male     NaN
2  NaN       1977     Mary   male  female
1   63       1955  Jessica   male  female
0   50       1968      Bob   male     NaN

### Boolean indexing

In [26]:
df

   Age Birthdates    Names Gender     Sex
0   50       1968      Bob   male     NaN
1   63       1955  Jessica   male  female
2  NaN       1977     Mary   male  female
3   40       1978     John   male     NaN
4  NaN       1973      Mel   male  female
5   17       2001      Max   male     NaN
6   67       1951     Mark   male     NaN
7  NaN       1973    Stark   male     NaN

In [27]:
MyDf = df.head()
MyDf[[True,True,False,True,False]]

  Age Birthdates    Names Gender     Sex
0  50       1968      Bob   male     NaN
1  63       1955  Jessica   male  female
3  40       1978     John   male     NaN

In [28]:
Age_filter = df['Age'] > 30
Age_filter

0     True
1     True
2    False
3     True
4    False
5    False
6     True
7    False
Name: Age, dtype: bool

In [29]:
df[Age_filter]

  Age Birthdates    Names Gender     Sex
0  50       1968      Bob   male     NaN
1  63       1955  Jessica   male  female
3  40       1978     John   male     NaN
6  67       1951     Mark   male     NaN

In [30]:
Age_sex_filter = (df['Sex'] == 'male') & (df['Age'] < 30) #we can't use 'and' it does not supports

df[Age_sex_filter]

Empty DataFrame
Columns: [Age, Birthdates, Names, Gender, Sex]
Index: []

### Some operations using pandas

In [31]:
df['Age'].max()

67

In [32]:
df['Age'].min()

17

In [33]:
df['Age'].mean()

47.4

In [34]:
df['Age'].median()

50.0

In [35]:
df['Age'].std()

20.08233054204616

In [36]:
df['Age'].isnull()

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7     True
Name: Age, dtype: bool

In [37]:
df['Age'].sum()

237

In [38]:
df['Birthdates'].count()

8

In [39]:
df['Birthdates'].value_counts()

1973    2
1951    1
1978    1
1977    1
1955    1
2001    1
1968    1
Name: Birthdates, dtype: int64

In [40]:
df['Birthdates'].value_counts().index

Int64Index([1973, 1951, 1978, 1977, 1955, 2001, 1968], dtype='int64')

In [41]:
for name,sex in df.groupby('Birthdates'): 
    print(name, "\n", sex, "\n")

1951
   Age Birthdates Names Gender  Sex
6  67       1951  Mark   male  NaN

1955
   Age Birthdates    Names Gender     Sex
1  63       1955  Jessica   male  female

1968
   Age Birthdates Names Gender  Sex
0  50       1968   Bob   male  NaN

1973
    Age Birthdates  Names Gender     Sex
4  NaN       1973    Mel   male  female
7  NaN       1973  Stark   male     NaN

1977
    Age Birthdates Names Gender     Sex
2  NaN       1977  Mary   male  female

1978
   Age Birthdates Names Gender  Sex
3  40       1978  John   male  NaN

2001
   Age Birthdates Names Gender  Sex
5  17       2001   Max   male  NaN

In [42]:
for name,sex in df.groupby('Sex'): 
    print(name, "\n", sex, "\n")

female
    Age Birthdates    Names Gender     Sex
1   63       1955  Jessica   male  female
2  NaN       1977     Mary   male  female
4  NaN       1973      Mel   male  female

### Pandas plotting

In [43]:
df

   Age Birthdates    Names Gender     Sex
0   50       1968      Bob   male     NaN
1   63       1955  Jessica   male  female
2  NaN       1977     Mary   male  female
3   40       1978     John   male     NaN
4  NaN       1973      Mel   male  female
5   17       2001      Max   male     NaN
6   67       1951     Mark   male     NaN
7  NaN       1973    Stark   male     NaN

In [44]:
df['Birthdates'].value_counts().plot(kind='bar')

In [45]:
mapping = {'male':0,'female':1}
df['Gender'] = df['Sex'].apply(lambda x: mapping[x])
df

KeyError: nan

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
plt.xticks(df['Gender'], ['male','female'], rotation='vertical')
plt.bar(df['Gender'],df['Age'],align = 'center',color='RGB')

In [ ]:
df['Birthdates'].plot(kind='hist')

### Dealing with the missing values

In [ ]:
df

In [ ]:
df.drop(['Sex'],axis = 1, inplace = True)
df.head()

In [ ]:
df1 = df.dropna(subset = ['Age'])
df1

In [ ]:
import numpy as np
df1['NaN_values'] = np.nan
df1

In [ ]:
df2 = df1.dropna(axis=1, how='all')

In [ ]:
df

In [ ]:
df.fillna(30)

In [ ]:
df.fillna(df['Age'].mean())